In [45]:
data = {'Name': ['John', 'Tim', 'Rob'], 
        'Age': [34, 23, 22],
        'Salary': [4500, 2300, 5800]}

In [46]:
from pandas import *
frame = DataFrame(data)

In [47]:
frame

   Name  Age  Salary
0  John   34    4500
1   Tim   23    2300
2   Rob   22    5800

In [48]:
new_frame = DataFrame(data, columns=['Name', 'Age', 'Salary', 'Profile'])

In [49]:
new_frame

   Name  Age  Salary Profile
0  John   34    4500     NaN
1   Tim   23    2300     NaN
2   Rob   22    5800     NaN

In [50]:
new_frame['Salary']

0    4500
1    2300
2    5800
Name: Salary, dtype: int64

In [51]:
new_frame.loc[2]

Name        Rob
Age          22
Salary     5800
Profile     NaN
Name: 2, dtype: object

In [52]:
new_frame['Profile']='Doctor'
new_frame

   Name  Age  Salary Profile
0  John   34    4500  Doctor
1   Tim   23    2300  Doctor
2   Rob   22    5800  Doctor

In [53]:
new_frame['Education']='MS'
new_frame

   Name  Age  Salary Profile Education
0  John   34    4500  Doctor        MS
1   Tim   23    2300  Doctor        MS
2   Rob   22    5800  Doctor        MS

In [54]:
new_frame = new_frame.T

In [55]:
new_frame

                0       1       2
Name         John     Tim     Rob
Age            34      23      22
Salary       4500    2300    5800
Profile    Doctor  Doctor  Doctor
Education      MS      MS      MS

In [56]:
new_frame = new_frame.T

In [57]:
new_frame

   Name Age Salary Profile Education
0  John  34   4500  Doctor        MS
1   Tim  23   2300  Doctor        MS
2   Rob  22   5800  Doctor        MS